html/scheme/tutorial/hashtable.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>哈希表</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Wu, Shanliang" />
<link rel="stylesheet" type="text/css" href="css/main.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="symbol.html"> UP </a>
 |
 <a accesskey="H" href="slt.html"> HOME </a>
</div><div id="content">
<h1 class="title">哈希表</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc2606fd">关联表</a></li>
<li><a href="#org628e652">哈希表</a></li>
<li><a href="#org8bcbb91">实例：生成密码</a>
<ul>
<li><a href="#org5668e74">stat-spell</a></li>
<li><a href="#org6058cb7">make-pw</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
本章中，会讲解用于表示 <b>数据关联</b> 的 <span class="underline">关联表</span> 和 <span class="underline">哈希表</span> 。关联的数据是由 <b>键</b> 和 <b>值</b> 组成的 <b>序对</b> ， <b>值由键唯一确定的</b> 。表1显示了书和作者构成的配对：
</p>

<table border="1" cellspacing="0" cellpadding="6" rules="all" frame="boader">
<caption class="t-above"><span class="table-number">Table 1:</span> 作者和书</caption>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Author</td>
<td class="org-left">Book</td>
</tr>

<tr>
<td class="org-left">P. Graham</td>
<td class="org-left">On Lisp</td>
</tr>

<tr>
<td class="org-left">P. Graham</td>
<td class="org-left">ANSI Common Lisp</td>
</tr>

<tr>
<td class="org-left">E. S. Raymond</td>
<td class="org-left">The Cathedral and the Bazaar</td>
</tr>

<tr>
<td class="org-left">K. Dybvig</td>
<td class="org-left">The Scheme Programming Language</td>
</tr>

<tr>
<td class="org-left">F. P. Brooks, Jr.</td>
<td class="org-left">The Mythical Man-Month</td>
</tr>

<tr>
<td class="org-left">L. Carroll</td>
<td class="org-left">Alice's Adventures in Wonderland</td>
</tr>

<tr>
<td class="org-left">L. Carroll</td>
<td class="org-left">Through the Looking-Glass, and What Alice Found There</td>
</tr>
</tbody>
</table>

<pre class="example">
  书籍可以确定作者，反之由作者确定书籍则不可，这是因为一个作者可能会写很多本书

  表1中，由于P. Graham和L.Carroll分别写了两本书，因此他们的书无法被作者的名字唯一确定
</pre>

<ul class="org-ul">
<li>R5RS 定义了 <span class="underline">关联表</span> ，因此它在所有Scheme实现中都可用。但是 <b>使用关联表搜索速度较慢</b> （ <span class="underline">O(n)</span> 的时间复杂度）</li>
<li>使用 <span class="underline">哈希表</span> 在速度方面更好一些（ <span class="underline">O(1)</span> 的时间复杂度），但是哈希表并未在 R5RS 中定义而是依赖于相关实现</li>
</ul>

<pre class="example">
MIT-Scheme实现了哈希表。如果你喜欢的Scheme实现没有哈希表，可以自己实现一个
</pre>
<div id="outline-container-orgc2606fd" class="outline-2">
<h2 id="orgc2606fd">关联表</h2>
<div class="outline-text-2" id="text-orgc2606fd">
<p>
<b>关联表</b> 是一个由 <b>序对</b> 组成的表，它是一个用于 <b>表达关联</b> 的基本数据类型：
</p>
<ul class="org-ul">
<li><span class="underline">符号</span> ， <span class="underline">字符</span> ，和 <span class="underline">数字</span> 常被作为 <b>键</b> 使用，因为它们可以使用诸如 <span class="underline">eq?</span> 或者 <span class="underline">eqv?</span> 的 <b>快速比较函数</b> 被比较</li>
<li>在作为键被使用前， <span class="underline">字符串</span> 应该被转换为 <b>符号</b> ，从而获得更好的性能</li>
</ul>

<p>
关联表应该要么由 <b>点序对</b> 要么由 <b>普通表</b> 组成。下面是一个关联表的例子：
</p>
<pre class="example">
'((hi . 3) (everybody . 5) (nice . 3) (to . 10) (meet . 4) (you . 8))

'((1 2 3) (4 5 6) (7 8 9))
</pre>

<p>
函数 <span class="underline">assq</span> ， <span class="underline">assv</span> ，和 <span class="underline">assoc</span> 从关联表中 <b>搜寻</b> 一个项：
</p>
<ul class="org-ul">
<li>这些函数从 <b>开始</b> 一步步搜索关联表
<ul class="org-ul">
<li>如果它们找到序对的 <span class="underline">car</span> 等于给定的 <span class="underline">key</span> ，就 <b>返回</b> 该 <span class="underline">序对</span></li>
<li>如果 <b>找不到</b> 函数返回 <span class="underline">#f</span></li>
</ul></li>
<li>这些函数分别使用 <span class="underline">eq?</span> ， <span class="underline">eqv?</span> ，和 <span class="underline">equal?</span> 比较键
<ul class="org-ul">
<li>这意味着 assq 最快，assoc最慢</li>
<li>作为键的话， <span class="underline">字符串</span> ， <span class="underline">向量</span> 和 <span class="underline">表</span> 应该转化为 <b>符号</b> 或者 <b>数字</b> （如果可能的话）以 <b>提高性能</b></li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">wc</span> '<span style="color: #696969;">((</span>hi . 3<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>everybody . 5<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>nice . 3<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>to . 10<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>meet . 4<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>you . 8<span style="color: #696969;">)))</span>
<span style="color: #696969;">(</span>assq 'hi wc<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; (hi .3) </span>
<span style="color: #696969;">(</span>assq 'you wc<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; (you . 8) </span>
<span style="color: #696969;">(</span>assq 'i wc<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; #f </span>

<span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #daa520; font-weight: bold;">n</span> '<span style="color: #696969;">((</span>1 2 3<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>4 5 6<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>7 8 9<span style="color: #696969;">)))</span>
<span style="color: #696969;">(</span>assv 1 n<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; ( 1 2 3) </span>
<span style="color: #696969;">(</span>assv 8 n<span style="color: #696969;">)</span> <span style="color: #5f9ea0; font-style: italic;">; </span><span style="color: #5f9ea0; font-style: italic;">=&gt; #f </span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org628e652" class="outline-2">
<h2 id="org628e652">哈希表</h2>
<div class="outline-text-2" id="text-org628e652">
<p>
<span class="underline">哈希表</span> 是一种数据类型，它使用 <b>哈希函数</b> 将 <span class="underline">键</span> 转化为 <span class="underline">整数</span> ，并将*值存储在由该整数所指示的位置* 。当表足够 <b>稀疏</b> 时， <span class="underline">搜索</span> ， <span class="underline">插入</span> ， <span class="underline">更新</span> 都能以 <span class="underline">O(1)</span> 完成。下面展示了 MIT-Scheme 里哈希表的一些基本函数：
</p>

<ul class="org-ul">
<li>创建哈希表， <span class="underline">初始大小</span> 可以 <b>选择性指定</b> 
<ul class="org-ul">
<li>(make-eq-hash-table size) : 使用 <span class="underline">eq?</span> 比较键的值</li>
<li>(make-eqv-hash-table size) : 使用 <span class="underline">eqv?</span> 比较键的值</li>
<li>(make-equal-hash-table size) : 使用 <span class="underline">equal?</span> 比较键的值</li>
<li>(make-string-hash-table size) : 使用 <span class="underline">string=?</span> 比较键的值</li>
</ul></li>
</ul>

<pre class="example">
    由于只比较键的地址，所以 eq-hash-table 是最快的

    由于键是序列，所以 equal-hash-table 和 string-hash-table 比较慢
</pre>

<ul class="org-ul">
<li>(hash-table/put! hash-table key datum) : 将 <span class="underline">hash-table</span> 中 <span class="underline">key</span> 对应的 <b>值</b> 设为 <span class="underline">datum</span></li>
<li>(hash-table/get hash-table key default) : <b>返回</b> <span class="underline">hash-table</span> 中的 <span class="underline">key</span> 对应的值
<ul class="org-ul">
<li>如果 <span class="underline">key</span> 不存在于 <span class="underline">hash-table</span> 中，返回 <span class="underline">default</span></li>
</ul></li>
<li>(hash-table-&gt;alist hash-table): 将 <span class="underline">hash-table</span> 转换为 <span class="underline">关联表</span></li>
</ul>
</div>
</div>
<div id="outline-container-org8bcbb91" class="outline-2">
<h2 id="org8bcbb91">实例：生成密码</h2>
<div class="outline-text-2" id="text-org8bcbb91">
<p>
写一个密码创建程序作为关联表和哈希表的例子
</p>

<p>
从字典里得到的密码很容易被破解，但另一方面，完全随机的密码又很难记忆和输入。程序使用无规则的拼写创建10个密码。密码应该尽可能频繁更改，但是懒于自己创建密码。使用这个程序，可以简单地改变密码
</p>

<p>
程序由两部分构成：
</p>
<ol class="org-ol">
<li>stat-spell.scm : 用于创建连续字符出现频率的数据</li>
<li>make-pw.scm : 用于基于这个数据创建密码</li>
</ol>
</div>
