src/scheme/tutorial/hashtable.org
** stat-spell
   (skip-char? c) : 如果 c 不是图像字符 或者 c 是 _#\:_ ,  _#\;_ ,  _#\'_ , or _#\"_ ，就返回 _#t_ 。 *读取文本时，这些字符会被跳过* 
   #+BEGIN_SRC scheme
  (define (skip-char? c)
    (or (not (char-graphic? c))
	(memv c '(#\: #\; #\' #\" #\`))))
   #+END_SRC

   (ss-make-alist c alist) : 有两个参数 
   + alist :  _字符频率_ 的 _关联表_
   + c: 字符 

   + 如果 c 在 alist 中，在 _序对的cdr_ 部分增加 1
   + 如果不在，返回  _(cons (cons c 1) alist)_ 

   这个函数使用了 *set-cdr!* 

   #+BEGIN_SRC scheme
  (define (ss-make-alist c alist)
    (let ((p (assv c alist)))
      (if p
	  (begin
	    (set-cdr! p (1+ (cdr p)))
	    alist)
	  (cons (cons c 1) alist))))
   #+END_SRC

   (ss-make-dat filename) : 
   + 从名为 _filename_ 的文件中 *读取字符*
   + 并使用跟随 _字符频率的关联表_ 来 *关联* 这些读出的 _字符_
   + 结果以 _关联表_ 形式存储在文件 _stat-spell.dat_ 
     + 它在哈希表中更新了频率的关联表
     + 存储在 _stat-spell.dat_ 的最终数据是一个 *关联表的关联表* 

   #+BEGIN_SRC scheme
  (define (ss-make-dat filename)
    (let ((char-hash (make-eqv-hash-table)))
      (with-input-from-file filename
	(lambda ()
	  (let loop ((c #\Space))
	    (let ((c1 (read-char)))
	      (if (not (eof-object? c1))
		  (if (skip-char? c1)
		      (loop c)
		      (let ((c1 (char-downcase c1)))
			(hash-table/put! char-hash c
					 (ss-make-alist c1 (hash-table/get char-hash c '())))
			(loop c1))))))))
      (with-output-to-file "stat-spell.dat"
	(lambda ()
	  (display "(define *stat-spell* \'(")
	  (newline)
	  (let loop ((alst (sort (hash-table->alist char-hash) 
				 (lambda (x y) (char<? (car x) (car y))))))
	    (if (pair? alst)
		(begin
		  (write (car alst))
		  (newline)
		  (loop (cdr alst)))))
	  (display "))")
	  (newline)))))
   #+END_SRC
