html/scheme/tutorial/hashtable.html

<div id="outline-container-org5668e74" class="outline-3">
<h3 id="org5668e74">stat-spell</h3>
<div class="outline-text-3" id="text-org5668e74">
<p>
(skip-char? c) : 如果 c 不是图像字符 或者 c 是 <span class="underline">#\:</span> ,  <span class="underline">#\;</span> ,  <span class="underline">#\'</span> , or <span class="underline">#\"</span> ，就返回 <span class="underline">#t</span> 。 <b>读取文本时，这些字符会被跳过</b> 
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">skip-char?</span> c<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">or</span> <span style="color: #696969;">(</span>not <span style="color: #696969;">(</span>char-graphic? c<span style="color: #696969;">))</span>
      <span style="color: #696969;">(</span>memv c '<span style="color: #696969;">(</span>#\: #\; #\' #\" #\`<span style="color: #696969;">))))</span>
</pre>
</div>

<p>
(ss-make-alist c alist) : 有两个参数 
</p>
<ul class="org-ul">
<li>alist :  <span class="underline">字符频率</span> 的 <span class="underline">关联表</span></li>
<li>c: 字符</li>

<li>如果 c 在 alist 中，在 <span class="underline">序对的cdr</span> 部分增加 1</li>
<li>如果不在，返回  <span class="underline">(cons (cons c 1) alist)</span></li>
</ul>

<p>
这个函数使用了 <b>set-cdr!</b> 
</p>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">ss-make-alist</span> c alist<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>p <span style="color: #696969;">(</span>assv c alist<span style="color: #696969;">)))</span>
    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> p
        <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">begin</span>
          <span style="color: #696969;">(</span>set-cdr! p <span style="color: #696969;">(</span>1+ <span style="color: #696969;">(</span>cdr p<span style="color: #696969;">)))</span>
          alist<span style="color: #696969;">)</span>
        <span style="color: #696969;">(</span>cons <span style="color: #696969;">(</span>cons c 1<span style="color: #696969;">)</span> alist<span style="color: #696969;">))))</span>
</pre>
</div>

<p>
(ss-make-dat filename) : 
</p>
<ul class="org-ul">
<li>从名为 <span class="underline">filename</span> 的文件中 <b>读取字符</b></li>
<li>并使用跟随 <span class="underline">字符频率的关联表</span> 来 <b>关联</b> 这些读出的 <span class="underline">字符</span></li>
<li>结果以 <span class="underline">关联表</span> 形式存储在文件 <span class="underline">stat-spell.dat</span> 
<ul class="org-ul">
<li>它在哈希表中更新了频率的关联表</li>
<li>存储在 <span class="underline">stat-spell.dat</span> 的最终数据是一个 <b>关联表的关联表</b></li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">define</span> <span style="color: #696969;">(</span><span style="color: #daa520; font-weight: bold;">ss-make-dat</span> filename<span style="color: #696969;">)</span>
  <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>char-hash <span style="color: #696969;">(</span>make-eqv-hash-table<span style="color: #696969;">)))</span>
    <span style="color: #696969;">(</span>with-input-from-file filename
      <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">()</span>
        <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #daa520; font-weight: bold;">loop</span> <span style="color: #696969;">((</span>c #\Space<span style="color: #696969;">))</span>
          <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>c1 <span style="color: #696969;">(</span>read-char<span style="color: #696969;">)))</span>
            <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>not <span style="color: #696969;">(</span>eof-object? c1<span style="color: #696969;">))</span>
                <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>skip-char? c1<span style="color: #696969;">)</span>
                    <span style="color: #696969;">(</span>loop c<span style="color: #696969;">)</span>
                    <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #696969;">((</span>c1 <span style="color: #696969;">(</span>char-downcase c1<span style="color: #696969;">)))</span>
                      <span style="color: #696969;">(</span>hash-table/put! char-hash c
                                       <span style="color: #696969;">(</span>ss-make-alist c1 <span style="color: #696969;">(</span>hash-table/get char-hash c '<span style="color: #696969;">())))</span>
                      <span style="color: #696969;">(</span>loop c1<span style="color: #696969;">))))))))</span>
    <span style="color: #696969;">(</span>with-output-to-file <span style="color: #deb887;">"stat-spell.dat"</span>
      <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">()</span>
        <span style="color: #696969;">(</span>display <span style="color: #deb887;">"(define *stat-spell* \'("</span><span style="color: #696969;">)</span>
        <span style="color: #696969;">(</span>newline<span style="color: #696969;">)</span>
        <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">let</span> <span style="color: #daa520; font-weight: bold;">loop</span> <span style="color: #696969;">((</span>alst <span style="color: #696969;">(</span>sort <span style="color: #696969;">(</span>hash-table-&gt;alist char-hash<span style="color: #696969;">)</span> 
                               <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">lambda</span> <span style="color: #696969;">(</span>x y<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>char&lt;? <span style="color: #696969;">(</span>car x<span style="color: #696969;">)</span> <span style="color: #696969;">(</span>car y<span style="color: #696969;">))))))</span>
          <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">if</span> <span style="color: #696969;">(</span>pair? alst<span style="color: #696969;">)</span>
              <span style="color: #696969;">(</span><span style="color: #00bfff; font-weight: bold;">begin</span>
                <span style="color: #696969;">(</span>write <span style="color: #696969;">(</span>car alst<span style="color: #696969;">))</span>
                <span style="color: #696969;">(</span>newline<span style="color: #696969;">)</span>
                <span style="color: #696969;">(</span>loop <span style="color: #696969;">(</span>cdr alst<span style="color: #696969;">)))))</span>
        <span style="color: #696969;">(</span>display <span style="color: #deb887;">"))"</span><span style="color: #696969;">)</span>
        <span style="color: #696969;">(</span>newline<span style="color: #696969;">)))))</span>
</pre>
</div>
</div>
</div>
